org/blog.org
:CONFIG:
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+macro: updatetime {{{time(%B %e\, %Y)}}}
#+hugo_auto_set_lastmod: t
#+startup: hidestars
#+startup: overview
#+startup: logdone
# #+startup: inlineimages
# #+startup: latexpreview
:END:

#+title: Blog Source File
#+author: Prashant Tak

** Combinatorial Mathematics :noexport:
:PROPERTIES:
:EXPORT_FILE_NAME: combi-math
:END:
*** General Counting Methods for Selection and Arrangement
1. Addition Principle:
   If there are $r_1$ different objects in the first set, $r_2$ different objects in the second set, . . . , and $r_m$ different objects in the m^th set, and if the different sets are disjoint, then the number of ways to select an object from one of the m sets is $r_1 +r_2 + · · · +r_m$.
2. Multiplication Principle:
   Suppose a procedure can be broken into m successive (ordered) stages, with $r_1$ different outcomes in the first stage, $r_2$ different outcomes in the second stage,. . . ,and $r_m$ different outcomes in the mth stage. If the number of outcomes at each stage is independent of the choices in previous stages and if the composite outcomes are all distinct, then the total procedure has $r_{1} ×r_{2} × · · · ×r_{m}$ different composite outcomes.
3. Remember that the addition principle requires disjoint sets of objects and the multiplication principle requires that the procedure break into ordered stages and that the composite outcomes be distinct.
4. A permutation of n distinct objects is an arrangement, or ordering, of the n objects. An r-permutation of n distinct objects is an arrangement using r of the n objects.
5. An r-combination of n distinct objects is an unordered selection, or subset, of r out of the n objects.
6. *Theorem 1:* If there are n objects, with $r_1$ of type 1, $r_2$ of type 2, . . . , and $r_m$ of type m, where $r_1 +r_2 + · · · +r_m = n$, then the number of arrangements of these n objects, denoted $P(n; r_{1}, r_{2}, . . . , r_{m})$, is
   \[
        P(n;r_{1},r_{2}, . . . ,r_{m}) = \frac{n!}{r_{1}!r_{2}! . . .r_{m}!}
   \]
7. *Theorem 2:* The number of selections with repetition of r objects chosen from n types of objects is C(r + n − 1,r).
8. Distributions of /distinct objects/ are equivalent to *arrangements* and Distributions of /identical objects/ are equivalent to *selections*.
9. Ways to arrange, select, distribute /r/ objects from /n/ items or into /n/ boxes:
   | Repition   | Arrangement                   | Combination |
   |------------+-------------------------------+-------------|
   | No         | P(n,r)                        | C(n,r)      |
   | Unlimited  | n^r                           | C(n+r-1, r) |
   | Restricted | P(n; r_{1}, r_{2}, .., r_{m}) | -           |
10. Equations with integer-valued variables are called /diophantine/ equations.
11. Equivalent forms of selection with repetition:
    + Number of ways to select /r/ objects with repetition from /n/ different types of objects.
    + Number of ways to distribute /r/ identical objects into /n/ distinct boxes.
    + Number of non-negative integer solutions to $x_1 + x_2 + ... + x_n = r$
12. *Binomial Theorem*:
    \[
        (1+x)^n = C(n,0) + C(n,1)x + C(n,2)x^2 + ... + C(n,k)x^k + C(n,n)x^n
     \]
13. Committee Selection Model: Represent C(n,k) committees of /k/ people chosen from a set of /n/ people.
14. Block Walking Model: Using Pascal's triangle, label each street corner in the network with the pair (n,k) where /n/ is the number of blocks traversed from (0,0) and /k/ is the number of times the person chose the right branch at intersections.

*** Generating Functions
1. Assuming /a_{r}/ denotes the /number of ways to select r objects/ in a certain procedure, g(x) is a generating function for a_{r} if g(x) has the polynomial expansion:
   \[
        g(x) = a_0 + a_1 x + a_2 x^2 + ... + a_r x^r + a_n x^n
   \]
2. \[
        \frac{1-x^{m+1}}{1-x} = 1+x+x^{2}+...+x^{m}
   \]
3. \[
        \frac{1}{1-x} = 1+x+x^{2}+...
   \]
4. \[
        (1+x)^n = 1 + {n \choose 1} x + {n \choose 2} x^2 + ... + {n \choose r} x^r + ... + {n \choose n} x^n
   \]
5. \[
        (1-x^{m})^n = 1 - {n \choose 1} x^m + {n \choose 2} x^{2m} + ... + (-1)^k {n \choose k} x^{km} + ... + (-1)^r {n \choose n} x^{nm}
   \]
6. \[
        \frac{1}{(1-x)^n} = 1 + {1+n-1 \choose 1} x + {2+n-1 \choose 2} x^2 + ... + {r+n-1 \choose r} x^r + ...
   \]
7. If h(x) = f(x)g(x) where \(f(x) = a_0 + a_1 x + a_2 x^2 + ...\) and \(g(x) = b_0 + b_1 x + b_2 x^2 + ...\) then:
   \[
        h(x) = a_{0}b_{0}+(a_{1}b_{0}+a_{0}b_{1})x + ... + (a_{r}b_{0}+a_{r-1}b_{1}+a_{r-2}b_{2}+ ... +a_{0}b_{r}) x^r + ...
   \]
8. Partition
9. Exp Gen Fn
10. Summation Method
